In [3]:
## Importing libraries 

import pandas as pd 
import numpy as np 
import seaborn as sns
import matplotlib.pyplot as plt 

sns.set_style("whitegrid")

In [15]:
### Loading the dataset into a dataframe and Exploring the dataset

df = pd.read_csv("datasets\stock price.csv")

In [16]:
### Displaying the 5 rows
df.head()

  symbol        date      open      high       low     close    volume
0    AAL  2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
1   AAPL  2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
2    AAP  2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
3   ABBV  2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
4    ABC  2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391

In [17]:
### displaying the dataset shape i.e number of rows and columns
df.shape

(497472, 7)

In [18]:
#### Exploring the dataset types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 497472 entries, 0 to 497471
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   symbol  497472 non-null  object
 1   date    497472 non-null  object
 2   open    497461 non-null  float64
 3   high    497464 non-null  float64
 4   low     497464 non-null  float64
 5   close   497472 non-null  float64
 6   volume  497472 non-null  int64
dtypes: float64(4), int64(1), object(2)
memory usage: 26.6+ MB

-- From the datatypes, we discovered that `date` column is object. we'll have to change it's type to a date type.

In [19]:
### Converting the date column into a proper date type for an object type.
df['date'] = pd.to_datetime(df['date'],errors ="coerce")

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 497472 entries, 0 to 497471
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   symbol  497472 non-null  object
 1   date    497472 non-null  datetime64[ns]
 2   open    497461 non-null  float64
 3   high    497464 non-null  float64
 4   low     497464 non-null  float64
 5   close   497472 non-null  float64
 6   volume  497472 non-null  int64
dtypes: datetime64[ns](1), float64(4), int64(1), object(1)
memory usage: 26.6+ MB

In [21]:
#### Checking for Missing values in the dataset
df.isnull().sum()

symbol     0
date       0
open      11
high       8
low        8
close      0
volume     0
dtype: int64

In [22]:
df.isnull().sum() / df.shape[0] * 100

symbol    0.000000
date      0.000000
open      0.002211
high      0.001608
low       0.001608
close     0.000000
volume    0.000000
dtype: float64

From the result, we can see that we have some missing values in OPEN,HIGH and LOW column in the dataset. In order, to resolve this. we can drop the columns of the missing value because the missing is sigificantly small with a percentage of 0.002,0.001 and 0.001 percent of overall dataset.

In [23]:
### Handling the Missing values

df.dropna(inplace=True)

In [24]:
df.isnull().sum()

symbol    0
date      0
open      0
high      0
low       0
close     0
volume    0
dtype: int64

In [25]:
df.shape

(497461, 7)

In [29]:
df.to_csv(".\datasets\stock_cleaned.csv",index=False)